In [37]:
import pandas as pd
import numpy as np

In [38]:
SEED = 777
np.random.seed(SEED)

In [39]:
df = pd.read_csv('titanic.csv')

In [40]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [41]:
# df.drop('Age', axis=1)

In [42]:
df.Age.fillna(round(df.Age.median(),0), inplace = True)

In [43]:
df.dropna(subset=['Embarked'],inplace=True)

In [44]:
df.drop(['PassengerId','Fare','SibSp','Parch','Ticket','Name','Cabin'],axis=1,inplace = True)

In [45]:
df.tail()

     Survived  Pclass     Sex   Age Embarked
886         0       2    male  27.0        S
887         1       1  female  19.0        S
888         0       3  female  28.0        S
889         1       1    male  26.0        C
890         0       3    male  32.0        Q

In [46]:
df.loc[df.Sex=='male','Sex'] = 0
df.loc[df.Sex=='female','Sex'] = 1

In [47]:
df.loc[df.Embarked=='S','Embarked']=1
df.loc[df.Embarked=='C','Embarked']=2
df.loc[df.Embarked=='Q','Embarked']=3

In [48]:
df.tail()

     Survived  Pclass Sex   Age Embarked
886         0       2   0  27.0        1
887         1       1   1  19.0        1
888         0       3   1  28.0        1
889         1       1   0  26.0        2
890         0       3   0  32.0        3

In [49]:
from sklearn.model_selection import train_test_split

In [50]:
X_train, X_test, y_train, y_test = train_test_split(df.drop('Age', axis=1),
                                                   df.Age,
                                                   test_size=0.3,
                                                   random_state = SEED
                                                   )

In [51]:
X_train.head()

     Survived  Pclass Sex Embarked
91          0       3   0        1
250         0       3   0        1
623         0       3   0        1
215         1       1   1        2
57          0       3   0        2

In [52]:
X_train.shape

(622, 4)

In [53]:
y_train.median()

28.0

In [54]:
X_test.shape

(267, 4)

In [55]:
y_test.median()

28.0

In [56]:
from sklearn.linear_model import LinearRegression

In [57]:
lr = LinearRegression()

In [58]:
lr.fit(X_train,y_train)

LinearRegression()

In [59]:
pred = lr.predict(X_test)

In [60]:
from sklearn.metrics import mean_absolute_error

In [61]:
print('Ошибка на тесте', mean_absolute_error(y_test, pred))

Ошибка на тесте 8.781117495433449

In [62]:
print('Ошибка на обучающей выборке', mean_absolute_error(y_train, lr.predict(X_train)))

Ошибка на обучающей выборке 9.092924188949311

In [63]:
result = X_test

In [64]:
result['real'] = y_test
result['predict'] = pred

In [65]:
result[['real','predict']].to_excel('Age.xlsx')